{"SFM": {"2501.14277": {"paper_title": "Dense-SfM: Structure from Motion with Dense Consistent Matching", "paper_abstract": "We present Dense-SfM, a novel Structure from Motion (SfM) framework designed for dense and accurate 3D reconstruction from multi-view images. Sparse keypoint matching, which traditional SfM methods often rely on, limits both accuracy and point density, especially in texture-less areas. Dense-SfM addresses this limitation by integrating dense matching with a Gaussian Splatting (GS) based track extension which gives more consistent, longer feature tracks. To further improve reconstruction accuracy, Dense-SfM is equipped with a multi-view kernelized matching module leveraging transformer and Gaussian Process architectures, for robust track refinement across multi-views. Evaluations on the ETH3D and Texture-Poor SfM datasets show that Dense-SfM offers significant improvements in accuracy and density over state-of-the-art methods.", "paper_authors": "JongMin Lee, Sungjoo Yoo", "update_time": "2025-01-24", "comments": null, "paper_url": "http://arxiv.org/abs/2501.14277", "paper_id": "2501.14277", "code_url": null}}, "Visual Localization": {"2501.14587": {"paper_title": "Visual Localization via Semantic Structures in Autonomous Photovoltaic Power Plant Inspection", "paper_abstract": "Inspection systems utilizing unmanned aerial vehicles (UAVs) equipped with thermal cameras are increasingly popular for the maintenance of photovoltaic (PV) power plants. However, automation of the inspection task is a challenging problem as it requires precise navigation to capture images from optimal distances and viewing angles.   This paper presents a novel localization pipeline that directly integrates PV module detection with UAV navigation, allowing precise positioning during inspection. Detections are used to identify the power plant structures in the image and associate these with the power plant model. We define visually recognizable anchor points for the initial association and use object tracking to discern global associations. We present three distinct methods for visual segmentation of PV modules based on traditional computer vision, deep learning, and their fusion, and we evaluate their performance in relation to the proposed localization pipeline.   The presented methods were verified and evaluated using custom aerial inspection data sets, demonstrating their robustness and applicability for real-time navigation. Additionally, we evaluate the influence of the power plant model's precision on the localization methods.", "paper_authors": "Viktor Kozák, Karel Košnar, Jan Chudoba, Miroslav Kulich, Libor Přeučil", "update_time": "2025-01-24", "comments": "47 pages, 22 figures", "paper_url": "http://arxiv.org/abs/2501.14587", "paper_id": "2501.14587", "code_url": null}, "2501.14051": {"paper_title": "Revisiting CLIP: Efficient Alignment of 3D MRI and Tabular Data using Domain-Specific Foundation Models", "paper_abstract": "Multi-modal models require aligned, shared embedding spaces. However, common CLIP-based approaches need large amounts of samples and do not natively support 3D or tabular data, both of which are crucial in the medical domain. To address these issues, we revisit CLIP-style alignment by training a domain-specific 3D foundation model as an image encoder and demonstrate that modality alignment is feasible with only 62 MRI scans. Our approach is enabled by a simple embedding accumulation strategy required for training in 3D, which scales the amount of negative pairs across batches in order to stabilize training. We perform a thorough evaluation of various design choices, including the choice of backbone and loss functions, and evaluate the proposed methodology on zero-shot classification and image-retrieval tasks. While zero-shot image-retrieval remains challenging, zero-shot classification results demonstrate that the proposed approach can meaningfully align the representations of 3D MRI with tabular data.", "paper_authors": "Jakob Krogh Petersen, Valdemar Licht, Mads Nielsen, Asbjørn Munk", "update_time": "2025-01-23", "comments": "10 pages, 2 figures. To be published in ISBI 2025", "paper_url": "http://arxiv.org/abs/2501.14051", "paper_id": "2501.14051", "code_url": "https://github.com/jakekrogh/3d-clip-for-brain-mri"}, "2501.13968": {"paper_title": "Triplet Synthesis For Enhancing Composed Image Retrieval via Counterfactual Image Generation", "paper_abstract": "Composed Image Retrieval (CIR) provides an effective way to manage and access large-scale visual data. Construction of the CIR model utilizes triplets that consist of a reference image, modification text describing desired changes, and a target image that reflects these changes. For effectively training CIR models, extensive manual annotation to construct high-quality training datasets, which can be time-consuming and labor-intensive, is required. To deal with this problem, this paper proposes a novel triplet synthesis method by leveraging counterfactual image generation. By controlling visual feature modifications via counterfactual image generation, our approach automatically generates diverse training triplets without any manual intervention. This approach facilitates the creation of larger and more expressive datasets, leading to the improvement of CIR model's performance.", "paper_authors": "Kenta Uesugi, Naoki Saito, Keisuke Maeda, Takahiro Ogawa, Miki Haseyama", "update_time": "2025-01-22", "comments": "4 pages, 4 figures", "paper_url": "http://arxiv.org/abs/2501.13968", "paper_id": "2501.13968", "code_url": null}}, "Image Matching": {"2501.14277": {"paper_title": "Dense-SfM: Structure from Motion with Dense Consistent Matching", "paper_abstract": "We present Dense-SfM, a novel Structure from Motion (SfM) framework designed for dense and accurate 3D reconstruction from multi-view images. Sparse keypoint matching, which traditional SfM methods often rely on, limits both accuracy and point density, especially in texture-less areas. Dense-SfM addresses this limitation by integrating dense matching with a Gaussian Splatting (GS) based track extension which gives more consistent, longer feature tracks. To further improve reconstruction accuracy, Dense-SfM is equipped with a multi-view kernelized matching module leveraging transformer and Gaussian Process architectures, for robust track refinement across multi-views. Evaluations on the ETH3D and Texture-Poor SfM datasets show that Dense-SfM offers significant improvements in accuracy and density over state-of-the-art methods.", "paper_authors": "JongMin Lee, Sungjoo Yoo", "update_time": "2025-01-24", "comments": null, "paper_url": "http://arxiv.org/abs/2501.14277", "paper_id": "2501.14277", "code_url": null}}, "NeRF": {"2501.14646": {"paper_title": "SyncAnimation: A Real-Time End-to-End Framework for Audio-Driven Human Pose and Talking Head Animation", "paper_abstract": "Generating talking avatar driven by audio remains a significant challenge. Existing methods typically require high computational costs and often lack sufficient facial detail and realism, making them unsuitable for applications that demand high real-time performance and visual quality. Additionally, while some methods can synchronize lip movement, they still face issues with consistency between facial expressions and upper body movement, particularly during silent periods. In this paper, we introduce SyncAnimation, the first NeRF-based method that achieves audio-driven, stable, and real-time generation of speaking avatar by combining generalized audio-to-pose matching and audio-to-expression synchronization. By integrating AudioPose Syncer and AudioEmotion Syncer, SyncAnimation achieves high-precision poses and expression generation, progressively producing audio-synchronized upper body, head, and lip shapes. Furthermore, the High-Synchronization Human Renderer ensures seamless integration of the head and upper body, and achieves audio-sync lip. The project page can be found at https://syncanimation.github.io", "paper_authors": "Yujian Liu, Shidang Xu, Jing Guo, Dingbin Wang, Zairan Wang, Xianfeng Tan, Xiaoli Liu", "update_time": "2025-01-24", "comments": "11 pages, 7 figures", "paper_url": "http://arxiv.org/abs/2501.14646", "paper_id": "2501.14646", "code_url": null}, "2501.13971": {"paper_title": "GS-LiDAR: Generating Realistic LiDAR Point Clouds with Panoramic Gaussian Splatting", "paper_abstract": "LiDAR novel view synthesis (NVS) has emerged as a novel task within LiDAR simulation, offering valuable simulated point cloud data from novel viewpoints to aid in autonomous driving systems. However, existing LiDAR NVS methods typically rely on neural radiance fields (NeRF) as their 3D representation, which incurs significant computational costs in both training and rendering. Moreover, NeRF and its variants are designed for symmetrical scenes, making them ill-suited for driving scenarios. To address these challenges, we propose GS-LiDAR, a novel framework for generating realistic LiDAR point clouds with panoramic Gaussian splatting. Our approach employs 2D Gaussian primitives with periodic vibration properties, allowing for precise geometric reconstruction of both static and dynamic elements in driving scenarios. We further introduce a novel panoramic rendering technique with explicit ray-splat intersection, guided by panoramic LiDAR supervision. By incorporating intensity and ray-drop spherical harmonic (SH) coefficients into the Gaussian primitives, we enhance the realism of the rendered point clouds. Extensive experiments on KITTI-360 and nuScenes demonstrate the superiority of our method in terms of quantitative metrics, visual quality, as well as training and rendering efficiency.", "paper_authors": "Junzhe Jiang, Chun Gu, Yurui Chen, Li Zhang", "update_time": "2025-01-22", "comments": null, "paper_url": "http://arxiv.org/abs/2501.13971", "paper_id": "2501.13971", "code_url": "https://github.com/fudan-zvg/gs-lidar"}}}