{"Visual Localization": {"2404.10527": {"paper_title": "SPVLoc: Semantic Panoramic Viewport Matching for 6D Camera Localization in Unseen Environments", "paper_abstract": "In this paper, we present SPVLoc, a global indoor localization method that accurately determines the six-dimensional (6D) camera pose of a query image and requires minimal scene-specific prior knowledge and no scene-specific training. Our approach employs a novel matching procedure to localize the perspective camera's viewport, given as an RGB image, within a set of panoramic semantic layout representations of the indoor environment. The panoramas are rendered from an untextured 3D reference model, which only comprises approximate structural information about room shapes, along with door and window annotations. We demonstrate that a straightforward convolutional network structure can successfully achieve image-to-panorama and ultimately image-to-model matching. Through a viewport classification score, we rank reference panoramas and select the best match for the query image. Then, a 6D relative pose is estimated between the chosen panorama and query image. Our experiments demonstrate that this approach not only efficiently bridges the domain gap but also generalizes well to previously unseen scenes that are not part of the training data. Moreover, it achieves superior localization accuracy compared to the state of the art methods and also estimates more degrees of freedom of the camera pose. We will make our source code publicly available at https://github.com/fraunhoferhhi/spvloc .", "paper_authors": "Niklas Gard, Anna Hilsmann, Peter Eisert", "update_time": "2024-04-16", "comments": "This submission includes the paper and supplementary material. 24\n  pages, 11 figures", "paper_url": "http://arxiv.org/abs/2404.10527", "paper_id": "2404.10527", "code_url": null}}, "Image Matching": {"2404.10626": {"paper_title": "Exploring selective image matching methods for zero-shot and few-sample unsupervised domain adaptation of urban canopy prediction", "paper_abstract": "We explore simple methods for adapting a trained multi-task UNet which predicts canopy cover and height to a new geographic setting using remotely sensed data without the need of training a domain-adaptive classifier and extensive fine-tuning. Extending previous research, we followed a selective alignment process to identify similar images in the two geographical domains and then tested an array of data-based unsupervised domain adaptation approaches in a zero-shot setting as well as with a small amount of fine-tuning. We find that the selective aligned data-based image matching methods produce promising results in a zero-shot setting, and even more so with a small amount of fine-tuning. These methods outperform both an untransformed baseline and a popular data-based image-to-image translation model. The best performing methods were pixel distribution adaptation and fourier domain adaptation on the canopy cover and height tasks respectively.", "paper_authors": "John Francis, Stephen Law", "update_time": "2024-04-16", "comments": "ICLR 2024 Machine Learning for Remote Sensing (ML4RS) Workshop", "paper_url": "http://arxiv.org/abs/2404.10626", "paper_id": "2404.10626", "code_url": null}}, "NeRF": {"2404.10625": {"paper_title": "Gaussian Splatting Decoder for 3D-aware Generative Adversarial Networks", "paper_abstract": "NeRF-based 3D-aware Generative Adversarial Networks (GANs) like EG3D or GIRAFFE have shown very high rendering quality under large representational variety. However, rendering with Neural Radiance Fields poses challenges for 3D applications: First, the significant computational demands of NeRF rendering preclude its use on low-power devices, such as mobiles and VR/AR headsets. Second, implicit representations based on neural networks are difficult to incorporate into explicit 3D scenes, such as VR environments or video games. 3D Gaussian Splatting (3DGS) overcomes these limitations by providing an explicit 3D representation that can be rendered efficiently at high frame rates. In this work, we present a novel approach that combines the high rendering quality of NeRF-based 3D-aware GANs with the flexibility and computational advantages of 3DGS. By training a decoder that maps implicit NeRF representations to explicit 3D Gaussian Splatting attributes, we can integrate the representational diversity and quality of 3D GANs into the ecosystem of 3D Gaussian Splatting for the first time. Additionally, our approach allows for a high resolution GAN inversion and real-time GAN editing with 3D Gaussian Splatting scenes.", "paper_authors": "Florian Barthel, Arian Beckmann, Wieland Morgenstern, Anna Hilsmann, Peter Eisert", "update_time": "2024-04-16", "comments": "CVPRW", "paper_url": "http://arxiv.org/abs/2404.10625", "paper_id": "2404.10625", "code_url": null}, "2404.10603": {"paper_title": "Enhancing 3D Fidelity of Text-to-3D using Cross-View Correspondences", "paper_abstract": "Leveraging multi-view diffusion models as priors for 3D optimization have alleviated the problem of 3D consistency, e.g., the Janus face problem or the content drift problem, in zero-shot text-to-3D models. However, the 3D geometric fidelity of the output remains an unresolved issue; albeit the rendered 2D views are realistic, the underlying geometry may contain errors such as unreasonable concavities. In this work, we propose CorrespondentDream, an effective method to leverage annotation-free, cross-view correspondences yielded from the diffusion U-Net to provide additional 3D prior to the NeRF optimization process. We find that these correspondences are strongly consistent with human perception, and by adopting it in our loss design, we are able to produce NeRF models with geometries that are more coherent with common sense, e.g., more smoothed object surface, yielding higher 3D fidelity. We demonstrate the efficacy of our approach through various comparative qualitative results and a solid user study.", "paper_authors": "Seungwook Kim, Kejie Li, Xueqing Deng, Yichun Shi, Minsu Cho, Peng Wang", "update_time": "2024-04-16", "comments": "25 pages, 22 figures, accepted to CVPR 2024", "paper_url": "http://arxiv.org/abs/2404.10603", "paper_id": "2404.10603", "code_url": null}, "2404.10441": {"paper_title": "1st Place Solution for ICCV 2023 OmniObject3D Challenge: Sparse-View Reconstruction", "paper_abstract": "In this report, we present the 1st place solution for ICCV 2023 OmniObject3D Challenge: Sparse-View Reconstruction. The challenge aims to evaluate approaches for novel view synthesis and surface reconstruction using only a few posed images of each object. We utilize Pixel-NeRF as the basic model, and apply depth supervision as well as coarse-to-fine positional encoding. The experiments demonstrate the effectiveness of our approach in improving sparse-view reconstruction quality. We ranked first in the final test with a PSNR of 25.44614.", "paper_authors": "Hang Du, Yaping Xue, Weidong Dai, Xuejun Yan, Jingjing Wang", "update_time": "2024-04-16", "comments": null, "paper_url": "http://arxiv.org/abs/2404.10441", "paper_id": "2404.10441", "code_url": null}, "2404.10318": {"paper_title": "SRGS: Super-Resolution 3D Gaussian Splatting", "paper_abstract": "Recently, 3D Gaussian Splatting (3DGS) has gained popularity as a novel explicit 3D representation. This approach relies on the representation power of Gaussian primitives to provide a high-quality rendering. However, primitives optimized at low resolution inevitably exhibit sparsity and texture deficiency, posing a challenge for achieving high-resolution novel view synthesis (HRNVS). To address this problem, we propose Super-Resolution 3D Gaussian Splatting (SRGS) to perform the optimization in a high-resolution (HR) space. The sub-pixel constraint is introduced for the increased viewpoints in HR space, exploiting the sub-pixel cross-view information of the multiple low-resolution (LR) views. The gradient accumulated from more viewpoints will facilitate the densification of primitives. Furthermore, a pre-trained 2D super-resolution model is integrated with the sub-pixel constraint, enabling these dense primitives to learn faithful texture features. In general, our method focuses on densification and texture learning to effectively enhance the representation ability of primitives. Experimentally, our method achieves high rendering quality on HRNVS only with LR inputs, outperforming state-of-the-art methods on challenging datasets such as Mip-NeRF 360 and Tanks & Temples. Related codes will be released upon acceptance.", "paper_authors": "Xiang Feng, Yongbo He, Yubo Wang, Yan Yang, Zhenzhong Kuang, Yu Jun, Jianping Fan, Jiajun ding", "update_time": "2024-04-16", "comments": "submit ACM MM 2024", "paper_url": "http://arxiv.org/abs/2404.10318", "paper_id": "2404.10318", "code_url": null}, "2404.10272": {"paper_title": "Plug-and-Play Acceleration of Occupancy Grid-based NeRF Rendering using VDB Grid and Hierarchical Ray Traversal", "paper_abstract": "Transmittance estimators such as Occupancy Grid (OG) can accelerate the training and rendering of Neural Radiance Field (NeRF) by predicting important samples that contributes much to the generated image. However, OG manages occupied regions in the form of the dense binary grid, in which there are many blocks with the same values that cause redundant examination of voxels' emptiness in ray-tracing. In our work, we introduce two techniques to improve the efficiency of ray-tracing in trained OG without fine-tuning. First, we replace the dense grids with VDB grids to reduce the spatial redundancy. Second, we use hierarchical digital differential analyzer (HDDA) to efficiently trace voxels in the VDB grids. Our experiments on NeRF-Synthetic and Mip-NeRF 360 datasets show that our proposed method successfully accelerates rendering NeRF-Synthetic dataset by 12% in average and Mip-NeRF 360 dataset by 4% in average, compared to a fast implementation of OG, NerfAcc, without losing the quality of rendered images.", "paper_authors": "Yoshio Kato, Shuhei Tarashima", "update_time": "2024-04-16", "comments": "Short paper for CVPR Neural Rendering Intelligence Workshop 2024.\n  Code: https://github.com/Yosshi999/faster-occgrid", "paper_url": "http://arxiv.org/abs/2404.10272", "paper_id": "2404.10272", "code_url": "https://github.com/yosshi999/faster-occgrid"}, "2404.09995": {"paper_title": "Taming Latent Diffusion Model for Neural Radiance Field Inpainting", "paper_abstract": "Neural Radiance Field (NeRF) is a representation for 3D reconstruction from multi-view images. Despite some recent work showing preliminary success in editing a reconstructed NeRF with diffusion prior, they remain struggling to synthesize reasonable geometry in completely uncovered regions. One major reason is the high diversity of synthetic contents from the diffusion model, which hinders the radiance field from converging to a crisp and deterministic geometry. Moreover, applying latent diffusion models on real data often yields a textural shift incoherent to the image condition due to auto-encoding errors. These two problems are further reinforced with the use of pixel-distance losses. To address these issues, we propose tempering the diffusion model's stochasticity with per-scene customization and mitigating the textural shift with masked adversarial training. During the analyses, we also found the commonly used pixel and perceptual losses are harmful in the NeRF inpainting task. Through rigorous experiments, our framework yields state-of-the-art NeRF inpainting results on various real-world scenes. Project page: https://hubert0527.github.io/MALD-NeRF", "paper_authors": "Chieh Hubert Lin, Changil Kim, Jia-Bin Huang, Qinbo Li, Chih-Yao Ma, Johannes Kopf, Ming-Hsuan Yang, Hung-Yu Tseng", "update_time": "2024-04-15", "comments": "Project page: https://hubert0527.github.io/MALD-NeRF", "paper_url": "http://arxiv.org/abs/2404.09995", "paper_id": "2404.09995", "code_url": null}, "2404.09833": {"paper_title": "Video2Game: Real-time, Interactive, Realistic and Browser-Compatible Environment from a Single Video", "paper_abstract": "Creating high-quality and interactive virtual environments, such as games and simulators, often involves complex and costly manual modeling processes. In this paper, we present Video2Game, a novel approach that automatically converts videos of real-world scenes into realistic and interactive game environments. At the heart of our system are three core components:(i) a neural radiance fields (NeRF) module that effectively captures the geometry and visual appearance of the scene; (ii) a mesh module that distills the knowledge from NeRF for faster rendering; and (iii) a physics module that models the interactions and physical dynamics among the objects. By following the carefully designed pipeline, one can construct an interactable and actionable digital replica of the real world. We benchmark our system on both indoor and large-scale outdoor scenes. We show that we can not only produce highly-realistic renderings in real-time, but also build interactive games on top.", "paper_authors": "Hongchi Xia, Zhi-Hao Lin, Wei-Chiu Ma, Shenlong Wang", "update_time": "2024-04-15", "comments": "CVPR 2024. Project page (with code): https://video2game.github.io/", "paper_url": "http://arxiv.org/abs/2404.09833", "paper_id": "2404.09833", "code_url": null}}}