{"SLAM": {"2502.08676": {"paper_title": "LIR-LIVO: A Lightweight,Robust LiDAR/Vision/Inertial Odometry with Illumination-Resilient Deep Features", "paper_abstract": "In this paper, we propose LIR-LIVO, a lightweight and robust LiDAR-inertial-visual odometry system designed for challenging illumination and degraded environments. The proposed method leverages deep learning-based illumination-resilient features and LiDAR-Inertial-Visual Odometry (LIVO). By incorporating advanced techniques such as uniform depth distribution of features enabled by depth association with LiDAR point clouds and adaptive feature matching utilizing Superpoint and LightGlue, LIR-LIVO achieves state-of-the-art (SOTA) accuracy and robustness with low computational cost. Experiments are conducted on benchmark datasets, including NTU-VIRAL, Hilti'22, and R3LIVE-Dataset. The corresponding results demonstrate that our proposed method outperforms other SOTA methods on both standard and challenging datasets. Particularly, the proposed method demonstrates robust pose estimation under poor ambient lighting conditions in the Hilti'22 dataset. The code of this work is publicly accessible on GitHub to facilitate advancements in the robotics community.", "paper_authors": "Shujie Zhou, Zihao Wang, Xinye Dai, Weiwei Song, Shengfeng Gu", "update_time": "2025-02-12", "comments": null, "paper_url": "http://arxiv.org/abs/2502.08676", "paper_id": "2502.08676", "code_url": null}}, "Visual Localization": {"2502.09411": {"paper_title": "ImageRAG: Dynamic Image Retrieval for Reference-Guided Image Generation", "paper_abstract": "Diffusion models enable high-quality and diverse visual content synthesis. However, they struggle to generate rare or unseen concepts. To address this challenge, we explore the usage of Retrieval-Augmented Generation (RAG) with image generation models. We propose ImageRAG, a method that dynamically retrieves relevant images based on a given text prompt, and uses them as context to guide the generation process. Prior approaches that used retrieved images to improve generation, trained models specifically for retrieval-based generation. In contrast, ImageRAG leverages the capabilities of existing image conditioning models, and does not require RAG-specific training. Our approach is highly adaptable and can be applied across different model types, showing significant improvement in generating rare and fine-grained concepts using different base models.   Our project page is available at: https://rotem-shalev.github.io/ImageRAG", "paper_authors": "Rotem Shalev-Arkushin, Rinon Gal, Amit H. Bermano, Ohad Fried", "update_time": "2025-02-13", "comments": null, "paper_url": "http://arxiv.org/abs/2502.09411", "paper_id": "2502.09411", "code_url": null}, "2502.08848": {"paper_title": "SpeechCompass: Enhancing Mobile Captioning with Diarization and Directional Guidance via Multi-Microphone Localization", "paper_abstract": "Speech-to-text capabilities on mobile devices have proven helpful for hearing and speech accessibility, language translation, note-taking, and meeting transcripts. However, our foundational large-scale survey (n=263) shows that the inability to distinguish and indicate speaker direction makes them challenging in group conversations. SpeechCompass addresses this limitation through real-time, multi-microphone speech localization, where the direction of speech allows visual separation and guidance (e.g., arrows) in the user interface. We introduce efficient real-time audio localization algorithms and custom sound perception hardware running on a low-power microcontroller and four integrated microphones, which we characterize in technical evaluations. Informed by a large-scale survey (n=494), we conducted an in-person study of group conversations with eight frequent users of mobile speech-to-text, who provided feedback on five visualization styles. The value of diarization and visualizing localization was consistent across participants, with everyone agreeing on the value and potential of directional guidance for group conversations.", "paper_authors": "Artem Dementyev, Dimitri Kavensky, Samuel J. Yang, Mathieu Parvaix, Chiong Lai, Alex Olwal", "update_time": "2025-02-12", "comments": "Accepted to CHI 2025", "paper_url": "http://arxiv.org/abs/2502.08848", "paper_id": "2502.08848", "code_url": null}}, "NeRF": {"2502.09623": {"paper_title": "Embed Any NeRF: Graph Meta-Networks for Neural Tasks on Arbitrary NeRF Architectures", "paper_abstract": "Neural Radiance Fields (NeRFs) have emerged as a groundbreaking paradigm for representing 3D objects and scenes by encoding shape and appearance information into the weights of a neural network. Recent works have shown how such weights can be used as input to frameworks processing them to solve deep learning tasks. Yet, these frameworks can only process NeRFs with a specific, predefined architecture. In this paper, we present the first framework that can ingest NeRFs with multiple architectures and perform inference on architectures unseen at training time. We achieve this goal by training a Graph Meta-Network in a representation learning framework. Moreover, we show how a contrastive objective is conducive to obtaining an architecture-agnostic latent space. In experiments on both MLP-based and tri-planar NeRFs, our approach demonstrates robust performance in classification and retrieval tasks that either matches or exceeds that of existing frameworks constrained to single architectures, thus providing the first architecture-agnostic method to perform tasks on NeRFs by processing their weights.", "paper_authors": "Francesco Ballerini, Pierluigi Zama Ramirez, Samuele Salti, Luigi Di Stefano", "update_time": "2025-02-13", "comments": "Under review", "paper_url": "http://arxiv.org/abs/2502.09623", "paper_id": "2502.09623", "code_url": null}, "2502.09111": {"paper_title": "DenseSplat: Densifying Gaussian Splatting SLAM with Neural Radiance Prior", "paper_abstract": "Gaussian SLAM systems excel in real-time rendering and fine-grained reconstruction compared to NeRF-based systems. However, their reliance on extensive keyframes is impractical for deployment in real-world robotic systems, which typically operate under sparse-view conditions that can result in substantial holes in the map. To address these challenges, we introduce DenseSplat, the first SLAM system that effectively combines the advantages of NeRF and 3DGS. DenseSplat utilizes sparse keyframes and NeRF priors for initializing primitives that densely populate maps and seamlessly fill gaps. It also implements geometry-aware primitive sampling and pruning strategies to manage granularity and enhance rendering efficiency. Moreover, DenseSplat integrates loop closure and bundle adjustment, significantly enhancing frame-to-frame tracking accuracy. Extensive experiments on multiple large-scale datasets demonstrate that DenseSplat achieves superior performance in tracking and mapping compared to current state-of-the-art methods.", "paper_authors": "Mingrui Li, Shuhong Liu, Tianchen Deng, Hongyu Wang", "update_time": "2025-02-13", "comments": null, "paper_url": "http://arxiv.org/abs/2502.09111", "paper_id": "2502.09111", "code_url": null}}}