{"SFM": {"2404.12547": {"paper_title": "Does Gaussian Splatting need SFM Initialization?", "paper_abstract": "3D Gaussian Splatting has recently been embraced as a versatile and effective method for scene reconstruction and novel view synthesis, owing to its high-quality results and compatibility with hardware rasterization. Despite its advantages, Gaussian Splatting's reliance on high-quality point cloud initialization by Structure-from-Motion (SFM) algorithms is a significant limitation to be overcome. To this end, we investigate various initialization strategies for Gaussian Splatting and delve into how volumetric reconstructions from Neural Radiance Fields (NeRF) can be utilized to bypass the dependency on SFM data. Our findings demonstrate that random initialization can perform much better if carefully designed and that by employing a combination of improved initialization strategies and structure distillation from low-cost NeRF models, it is possible to achieve equivalent results, or at times even superior, to those obtained from SFM initialization.", "paper_authors": "Yalda Foroutan, Daniel Rebain, Kwang Moo Yi, Andrea Tagliasacchi", "update_time": "2024-04-18", "comments": "14 pages, 6 figures", "paper_url": "http://arxiv.org/abs/2404.12547", "paper_id": "2404.12547", "code_url": null}}, "Keypoint Detection": {"2404.12625": {"paper_title": "SkelFormer: Markerless 3D Pose and Shape Estimation using Skeletal Transformers", "paper_abstract": "We introduce SkelFormer, a novel markerless motion capture pipeline for multi-view human pose and shape estimation. Our method first uses off-the-shelf 2D keypoint estimators, pre-trained on large-scale in-the-wild data, to obtain 3D joint positions. Next, we design a regression-based inverse-kinematic skeletal transformer that maps the joint positions to pose and shape representations from heavily noisy observations. This module integrates prior knowledge about pose space and infers the full pose state at runtime. Separating the 3D keypoint detection and inverse-kinematic problems, along with the expressive representations learned by our skeletal transformer, enhance the generalization of our method to unseen noisy data. We evaluate our method on three public datasets in both in-distribution and out-of-distribution settings using three datasets, and observe strong performance with respect to prior works. Moreover, ablation experiments demonstrate the impact of each of the modules of our architecture. Finally, we study the performance of our method in dealing with noise and heavy occlusions and find considerable robustness with respect to other solutions.", "paper_authors": "Vandad Davoodnia, Saeed Ghorbani, Alexandre Messier, Ali Etemad", "update_time": "2024-04-19", "comments": "12 pages, 8 figures", "paper_url": "http://arxiv.org/abs/2404.12625", "paper_id": "2404.12625", "code_url": null}}, "NeRF": {"2404.12970": {"paper_title": "FlyNeRF: NeRF-Based Aerial Mapping for High-Quality 3D Scene Reconstruction", "paper_abstract": "Current methods for 3D reconstruction and environmental mapping frequently face challenges in achieving high precision, highlighting the need for practical and effective solutions. In response to this issue, our study introduces FlyNeRF, a system integrating Neural Radiance Fields (NeRF) with drone-based data acquisition for high-quality 3D reconstruction. Utilizing unmanned aerial vehicle (UAV) for capturing images and corresponding spatial coordinates, the obtained data is subsequently used for the initial NeRF-based 3D reconstruction of the environment. Further evaluation of the reconstruction render quality is accomplished by the image evaluation neural network developed within the scope of our system. According to the results of the image evaluation module, an autonomous algorithm determines the position for additional image capture, thereby improving the reconstruction quality. The neural network introduced for render quality assessment demonstrates an accuracy of 97%. Furthermore, our adaptive methodology enhances the overall reconstruction quality, resulting in an average improvement of 2.5 dB in Peak Signal-to-Noise Ratio (PSNR) for the 10% quantile. The FlyNeRF demonstrates promising results, offering advancements in such fields as environmental monitoring, surveillance, and digital twins, where high-fidelity 3D reconstructions are crucial.", "paper_authors": "Maria Dronova, Vladislav Cheremnykh, Alexey Kotcov, Aleksey Fedoseev, Dzmitry Tsetserukou", "update_time": "2024-04-19", "comments": null, "paper_url": "http://arxiv.org/abs/2404.12970", "paper_id": "2404.12970", "code_url": null}, "2404.12547": {"paper_title": "Does Gaussian Splatting need SFM Initialization?", "paper_abstract": "3D Gaussian Splatting has recently been embraced as a versatile and effective method for scene reconstruction and novel view synthesis, owing to its high-quality results and compatibility with hardware rasterization. Despite its advantages, Gaussian Splatting's reliance on high-quality point cloud initialization by Structure-from-Motion (SFM) algorithms is a significant limitation to be overcome. To this end, we investigate various initialization strategies for Gaussian Splatting and delve into how volumetric reconstructions from Neural Radiance Fields (NeRF) can be utilized to bypass the dependency on SFM data. Our findings demonstrate that random initialization can perform much better if carefully designed and that by employing a combination of improved initialization strategies and structure distillation from low-cost NeRF models, it is possible to achieve equivalent results, or at times even superior, to those obtained from SFM initialization.", "paper_authors": "Yalda Foroutan, Daniel Rebain, Kwang Moo Yi, Andrea Tagliasacchi", "update_time": "2024-04-18", "comments": "14 pages, 6 figures", "paper_url": "http://arxiv.org/abs/2404.12547", "paper_id": "2404.12547", "code_url": null}}}